/* Boxcar email address field label */
"Email Address:" = "כתובת דואר אלקטרוני";

/* Failure adding email */
"Invalid Email" = "דואר אלקטרוני לא תקין";

/* Checkbox for only sending if idle by growl's idle detection */
"Only send if idle:" = "שלח רק אם במצב מנוחה";

/* Checkbox for sending only if priority is above a certain value */
"Only send if priority is at least:" = "שלח רק אם העדיפות היא לפחות";

/* Prefix notifications to boxcar checkbox */
"Prefix notifications with:" = "הוסף את התחילית הבאה להתראות";

/* Success adding boxcar */
"Registered!" = "רשום";

/* Failed adding boxcar, unknown email address */
"Unknown email" = "דואר אלקטרוני לא ידוע";

